jorsasoldo/IS_Proyecto_Videojuego_Runner/IS_PROYECTO_VIDEOJUEGO/Microcontrolador/PIC16F877A/Videojuego.c
#include <xc.h>
#define _XTAL_FREQ 4000000UL

#pragma config FOSC = XT
#pragma config WDTE = OFF
#pragma config PWRTE = ON
#pragma config BOREN = OFF
#pragma config LVP = OFF
#pragma config CPD = OFF
#pragma config WRT = OFF
#pragma config CP = OFF

// ============ DEFINICIONES DE HARDWARE ============
#define SALTA PORTDbits.RD0      // Botón para saltar
#define AGACHA PORTDbits.RD1     // Botón para agacharse

// Dimensiones del display
#define COLUMNAS 16
#define FILAS 2

// Caracteres personalizados en CGRAM
#define PERSONAJE 0
#define OBSTACULO 1

// Posición del score en pantalla
#define SCORE_COL 14

// ============ BUFFER UART OPTIMIZADO ============
#define BUFFER_SIZE 32
#define BUFFER_MASK 0x1F
volatile unsigned char uartBuffer[BUFFER_SIZE];
volatile unsigned char bufferWrite = 0;
volatile unsigned char bufferRead = 0;

// ============ ESTRUCTURA DE CONFIGURACIÓN DE NIVEL ============
typedef struct {
    unsigned char character[8];     // Sprite del personaje
    unsigned char obstacle[8];      // Sprite del obstáculo
    unsigned char goalType;         // 0=tiempo, 1=obstáculos
    unsigned int goalValue;         // Valor objetivo (0-9999)
    unsigned char characterLoaded;  // Flag de validación
    unsigned char obstacleLoaded;   // Flag de validación
    unsigned char goalLoaded;       // Flag de validación
} LevelConfig;

LevelConfig nivel;

// ============ ESTRUCTURA DE TELEMETRÍA ============
typedef struct {
    unsigned int obstaclesEsquivados;  // Total de obstáculos esquivados
    unsigned int tiempoTranscurrido;   // Tiempo en segundos (aproximado)
    unsigned char resultado;           // 0=lose, 1=win
    unsigned char partidaActiva;       // Flag de partida en curso
} GameTelemetry;

GameTelemetry telemetria;

// ============ VARIABLES DEL JUEGO ============
// Buffer de pantalla
unsigned char displayBuffer[FILAS][COLUMNAS];

// Variables de estado del juego
unsigned char Fila_Personaje = 1;        // 0 = arriba, 1 = abajo
unsigned char Columna_Personaje = 0;     // Columna fija del jugador
unsigned char Ult_Fila_Personaje = 1;    // Última fila del jugador
unsigned char Cont_Frame = 0;            // Contador de frames
unsigned char Activo = 1;                // Juego activo
unsigned char Cont_Obstaculo = 1;        // Contador de obstáculos
unsigned char puntuacion = 0;            // Puntuación actual
unsigned char semilla = 0;               // Semilla para aleatorios
unsigned char gameInitialized = 0;       // Flag de inicialización

// Variables para tiempo
volatile unsigned int timerTicks = 0;    // Contador de ticks del timer
unsigned int segundosJuego = 0;          // Segundos transcurridos

// Buffer temporal multiuso
#define TEMP_BUFFER_SIZE 5
unsigned char tempBuffer[TEMP_BUFFER_SIZE];

// ============ PROTOTIPOS DE FUNCIONES ============
// LCD
void E_ENC(void);
void COMANDO(unsigned char valor);
void DIGITO(unsigned char valor);
void LCD_Init(void);
void LCD_Posicion(unsigned char col, unsigned char fila);
void LCD_Escr_String(const char *str);
unsigned char LCD_CargarPersonaje(void);
unsigned char LCD_CargarObstaculo(void);
void LCD_CargarTodosSprites(void);

// UART
void UART_Init(void);
void UART_Escr(unsigned char dato);
void UART_Escr_String(const char *str);
unsigned char UART_Disp(void);
unsigned char UART_LeeBuffer(void);
unsigned char buscaChar(unsigned char c);
void UART_LimpiaBuffer(void);

// Juego
void inicializar_juego(void);
void reiniciar_juego(void);
void actualizar_pantalla(void);
void desplazar_mundo(void);
void generar_obstaculo(void);
void actualizar_score(void);
unsigned char random_number(unsigned char max);
void leer_botones(void);
unsigned char detectar_colision(void);
void evaluar_metas(void);
void inicializar_telemetria(void);
void enviar_telemetria(void);
void Timer1_Init(void);
void actualizar_tiempo(void);

// Parseo JSON
void JSON_Parse(void);
unsigned int strToUInt(unsigned char len);
unsigned char leerDigitos(void);
void enviarConfirmacion(void);
unsigned char validarConfiguracion(void);
void inicializarNivel(void);
void limpiarRecursos(void);

// ============ FUNCIONES LCD ============
void E_ENC(void) {
    PORTCbits.RC2 = 1;
    __delay_ms(5);
    PORTCbits.RC2 = 0;
    __delay_ms(2);
}

void COMANDO(unsigned char valor) {
    PORTB = valor;
    PORTCbits.RC0 = 0;  // RS = 0 (comando)
    PORTCbits.RC1 = 0;  // RW = 0 (escritura)
    E_ENC();
    __delay_ms(5);
}

void DIGITO(unsigned char valor) {
    PORTB = valor;
    PORTCbits.RC0 = 1;  // RS = 1 (dato)
    PORTCbits.RC1 = 0;  // RW = 0 (escritura)
    E_ENC();
    __delay_us(500);
}

void LCD_Init(void) {
    TRISB = 0x00;
    TRISCbits.TRISC0 = 0;
    TRISCbits.TRISC1 = 0;
    TRISCbits.TRISC2 = 0;
    
    __delay_ms(50);
    
    COMANDO(0x38);  // 8 bits, 2 líneas, 5x8
    COMANDO(0x0C);  // Display ON, cursor OFF
    COMANDO(0x01);  // Limpiar display
    COMANDO(0x06);  // Incrementar cursor
    __delay_ms(2);
}

// ============ ESCRITURA EN CGRAM ============
unsigned char LCD_CargarPersonaje(void) {
    unsigned char i;
    unsigned char addr = 0x40;
    
    COMANDO(addr);
    __delay_us(100);
    
    for(i = 0; i < 8; i++) {
        DIGITO(nivel.character[i]);
        __delay_us(50);
    }
    
    COMANDO(0x80);
    __delay_us(100);
    
    nivel.characterLoaded = 1;
    return 1;
}

unsigned char LCD_CargarObstaculo(void) {
    unsigned char i;
    unsigned char addr = 0x40 | (1 << 3);
    
    COMANDO(addr);
    __delay_us(100);
    
    for(i = 0; i < 8; i++) {
        DIGITO(nivel.obstacle[i]);
        __delay_us(50);
    }
    
    COMANDO(0x80);
    __delay_us(100);
    
    nivel.obstacleLoaded = 1;
    return 1;
}

void LCD_CargarTodosSprites(void) {
    LCD_CargarPersonaje();
    LCD_CargarObstaculo();
}

void LCD_Posicion(unsigned char col, unsigned char fila) {
    unsigned char addr;
    addr = (fila == 0) ? (0x80 + col) : (0xC0 + col);
    COMANDO(addr);
}

void LCD_Escr_String(const char *str) {
    while(*str) {
        DIGITO(*str++);
    }
}

// ============ FUNCIONES UART ============
void UART_Init(void) {
    TRISCbits.TRISC6 = 0;
    TRISCbits.TRISC7 = 1;
    ADCON1 = 0x07;
    
    SPBRG = 25;
    TXSTAbits.BRGH = 1;
    TXSTAbits.SYNC = 0;
    TXSTAbits.TXEN = 1;
    RCSTAbits.SPEN = 1;
    RCSTAbits.CREN = 1;
    
