jorsasoldo/IS_Proyecto_Videojuego_Runner/IS_PROYECTO_VIDEOJUEGO/Microcontrolador/PIC16F877A/Videojuego.c
    PIE1bits.RCIE = 1;
    INTCONbits.PEIE = 1;
    INTCONbits.GIE = 1;
    
    bufferWrite = 0;
    bufferRead = 0;
}

void UART_Escr(unsigned char dato) {
    while(!TXSTAbits.TRMT);
    TXREG = dato;
}

void UART_Escr_String(const char *str) {
    while(*str) {
        UART_Escr(*str++);
    }
}

// ============ TIMER1 PARA MEDICIÓN DE TIEMPO ============
void Timer1_Init(void) {
    T1CONbits.TMR1ON = 0;     // Timer1 OFF inicialmente
    T1CONbits.TMR1CS = 0;     // Reloj interno (FOSC/4)
    T1CONbits.T1CKPS0 = 1;    // Prescaler 1:8
    T1CONbits.T1CKPS1 = 1;
    TMR1 = 0;                 // Limpiar contador
    PIE1bits.TMR1IE = 1;      // Habilitar interrupción Timer1
    timerTicks = 0;
    segundosJuego = 0;
}

void actualizar_tiempo(void) {
    // Aproximación: cada 125000 ticks = 1 segundo con prescaler 1:8 a 4MHz
    // (4MHz / 4 / 8) = 125kHz → 125000 ticks = 1 seg
    if(timerTicks >= 125) {  // Ajustado para desbordamientos de Timer1
        timerTicks = 0;
        segundosJuego++;
        telemetria.tiempoTranscurrido = segundosJuego;
    }
}

void __interrupt() ISR(void) {
    // Interrupción UART
    if(PIR1bits.RCIF) {
        if(RCSTAbits.OERR) {
            RCSTAbits.CREN = 0;
            RCSTAbits.CREN = 1;
        }
        uartBuffer[bufferWrite & BUFFER_MASK] = RCREG;
        bufferWrite++;
    }
    
    // Interrupción Timer1 para tiempo
    if(PIR1bits.TMR1IF) {
        PIR1bits.TMR1IF = 0;
        timerTicks++;
        actualizar_tiempo();
    }
}

unsigned char UART_Disp(void) {
    return (bufferWrite != bufferRead);
}

unsigned char UART_LeeBuffer(void) {
    unsigned char dato;
    while(!UART_Disp());
    dato = uartBuffer[bufferRead & BUFFER_MASK];
    bufferRead++;
    return dato;
}

unsigned char buscaChar(unsigned char c) {
    unsigned char temp = bufferRead;
    while(temp != bufferWrite) {
        if(uartBuffer[temp & BUFFER_MASK] == c)
            return 1;
        temp++;
    }
    return 0;
}

void UART_LimpiaBuffer(void) {
    bufferRead = bufferWrite;
}

// ============ FUNCIONES DE CONVERSIÓN ============
unsigned int strToUInt(unsigned char len) {
    unsigned int resultado = 0;
    unsigned char i;
    
    for(i = 0; i < len && tempBuffer[i] != '\0'; i++) {
        resultado = (resultado << 3) + (resultado << 1) + (tempBuffer[i] - '0');
    }
    
    return resultado;
}

unsigned char leerDigitos(void) {
    unsigned char c, idx = 0;
    
    do {
        c = UART_LeeBuffer();
    } while(c == ' ' || c == ',');
    
    while(c >= '0' && c <= '9' && idx < TEMP_BUFFER_SIZE - 1) {
        tempBuffer[idx++] = c;
        c = UART_LeeBuffer();
    }
    
    tempBuffer[idx] = '\0';
    return idx;
}

// ============ PARSEO JSON ============
void JSON_Parse(void) {
    unsigned char c, i, len;
    unsigned int intentos = 0;
    
    nivel.characterLoaded = 0;
    nivel.obstacleLoaded = 0;
    nivel.goalLoaded = 0;
    
    while(!buscaChar('{') && intentos < 1000) {
        __delay_ms(10);
        intentos++;
    }
    
    if(intentos >= 1000) return;
    
    while(UART_LeeBuffer() != '{');
    
    // Parseo CHARACTER
    while(1) {
        c = UART_LeeBuffer();
        if(c == '"' && UART_LeeBuffer() == 'c')
            break;
    }
    while(UART_LeeBuffer() != '[');
    
    for(i = 0; i < 8; i++) {
        len = leerDigitos();
        nivel.character[i] = (unsigned char)strToUInt(len);
    }
    nivel.characterLoaded = 1;
    
    // Parseo OBSTACLE
    while(1) {
        c = UART_LeeBuffer();
        if(c == '"' && UART_LeeBuffer() == 'o')
            break;
    }
    while(UART_LeeBuffer() != '[');
    
    for(i = 0; i < 8; i++) {
        len = leerDigitos();
        nivel.obstacle[i] = (unsigned char)strToUInt(len);
    }
    nivel.obstacleLoaded = 1;
    
    // Parseo GOALTYPE
    while(1) {
        c = UART_LeeBuffer();
        if(c == 'g') {
            c = UART_LeeBuffer();
            if(c == 'o')
                break;
        }
    }
    
    while(UART_LeeBuffer() != ':');
    while(UART_LeeBuffer() != '"');
    
    c = UART_LeeBuffer();
    nivel.goalType = (c == 't') ? 0 : 1;
    
    // Parseo GOALVALUE
    while(1) {
        c = UART_LeeBuffer();
        if(c == 'g') {
            c = UART_LeeBuffer();
            if(c == 'o') {
                while(UART_LeeBuffer() != ':');
                break;
            }
        }
    }
    
    len = leerDigitos();
    nivel.goalValue = strToUInt(len);
    nivel.goalLoaded = 1;
}

// ============ CONFIRMACIÓN DE CARGA ============
void enviarConfirmacion(void) {
    UART_Escr_String("{\"status\":\"loaded\"");
    
    UART_Escr_String(",\"character\":\"");
    UART_Escr_String(nivel.characterLoaded ? "ok" : "error");
    UART_Escr_String("\"");
    
    UART_Escr_String(",\"obstacle\":\"");
    UART_Escr_String(nivel.obstacleLoaded ? "ok" : "error");
    UART_Escr_String("\"");
    
    UART_Escr_String(",\"goal\":\"");
    UART_Escr_String(nivel.goalLoaded ? "ok" : "error");
    UART_Escr_String("\"");
    
    UART_Escr_String(",\"goalType\":");
    UART_Escr((nivel.goalType == 0) ? '0' : '1');
    
    UART_Escr_String(",\"goalValue\":");
    {
        unsigned char buffer[6];
        unsigned char idx = 0;
        unsigned int val = nivel.goalValue;
        unsigned char temp;
        
        if(val == 0) {
            buffer[idx++] = '0';
        } else {
            unsigned char start = idx;
            while(val > 0) {
                buffer[idx++] = (val % 10) + '0';
                val /= 10;
            }
            unsigned char end = idx - 1;
            while(start < end) {
                temp = buffer[start];
                buffer[start] = buffer[end];
                buffer[end] = temp;
                start++;
                end--;
            }
        }
        buffer[idx] = '\0';
        
        for(temp = 0; temp < idx; temp++) {
            UART_Escr(buffer[temp]);
        }
    }
    
    UART_Escr_String("}\r\n");
}

