jorsasoldo/IS_Proyecto_Videojuego_Runner/IS_PROYECTO_VIDEOJUEGO/Microcontrolador/PIC16F877A/Videojuego.c
// ============ TELEMETRÍA DEL JUEGO ============
void inicializar_telemetria(void) {
    telemetria.obstaclesEsquivados = 0;
    telemetria.tiempoTranscurrido = 0;
    telemetria.resultado = 0;  // 0 = lose por defecto
    telemetria.partidaActiva = 1;
    
    // Reiniciar tiempo
    segundosJuego = 0;
    timerTicks = 0;
    TMR1 = 0;
    T1CONbits.TMR1ON = 1;  // Activar Timer1
}

void enviar_telemetria(void) {
    unsigned char buffer[6];
    unsigned char idx, temp;
    unsigned int val;
    
    // Construir JSON de telemetría
    UART_Escr_String("{\"obstacles\":");
    
    // Enviar obstáculos esquivados
    val = telemetria.obstaclesEsquivados;
    idx = 0;
    if(val == 0) {
        buffer[idx++] = '0';
    } else {
        unsigned char start = idx;
        while(val > 0) {
            buffer[idx++] = (val % 10) + '0';
            val /= 10;
        }
        unsigned char end = idx - 1;
        while(start < end) {
            temp = buffer[start];
            buffer[start] = buffer[end];
            buffer[end] = temp;
            start++;
            end--;
        }
    }
    buffer[idx] = '\0';
    for(temp = 0; temp < idx; temp++) {
        UART_Escr(buffer[temp]);
    }
    
    UART_Escr_String(",\"time\":");
    
    // Enviar tiempo transcurrido
    val = telemetria.tiempoTranscurrido;
    idx = 0;
    if(val == 0) {
        buffer[idx++] = '0';
    } else {
        unsigned char start = idx;
        while(val > 0) {
            buffer[idx++] = (val % 10) + '0';
            val /= 10;
        }
        unsigned char end = idx - 1;
        while(start < end) {
            temp = buffer[start];
            buffer[start] = buffer[end];
            buffer[end] = temp;
            start++;
            end--;
        }
    }
    buffer[idx] = '\0';
    for(temp = 0; temp < idx; temp++) {
        UART_Escr(buffer[temp]);
    }
    
    UART_Escr_String(",\"result\":\"");
    
    // Enviar resultado
    if(telemetria.resultado == 1) {
        UART_Escr_String("win");
    } else {
        UART_Escr_String("lose");
    }
    
    UART_Escr_String("\"}\r\n");
    
    // Detener Timer1
    T1CONbits.TMR1ON = 0;
    telemetria.partidaActiva = 0;
}

void limpiarRecursos(void) {
    unsigned char i;
    
    UART_LimpiaBuffer();
    
    for(i = 0; i < TEMP_BUFFER_SIZE; i++) {
        tempBuffer[i] = 0;
    }
    
    if(RCSTAbits.OERR) {
        RCSTAbits.CREN = 0;
        RCSTAbits.CREN = 1;
    }
    
    while(PIR1bits.RCIF) {
        i = RCREG;
    }
}

unsigned char validarConfiguracion(void) {
    if(!nivel.characterLoaded || !nivel.obstacleLoaded || !nivel.goalLoaded) {
        return 0;
    }
    
    if(nivel.goalValue == 0 || nivel.goalValue > 9999) {
        return 0;
    }
    
    if(nivel.goalType > 1) {
        return 0;
    }
    
    return 1;
}

void inicializarNivel(void) {
    unsigned char i;
    
    for(i = 0; i < 8; i++) {
        nivel.character[i] = 0;
        nivel.obstacle[i] = 0;
    }
    
    nivel.goalType = 1;
    nivel.goalValue = 10;
    nivel.characterLoaded = 0;
    nivel.obstacleLoaded = 0;
    nivel.goalLoaded = 0;
}

// ============ FUNCIONES DEL JUEGO ============

void inicializar_juego(void) {
    unsigned char fil, col;
    
    COMANDO(0x01);
    __delay_ms(2);
    
    LCD_CargarTodosSprites();
    
    for(fil = 0; fil < FILAS; fil++) {
        for(col = 0; col < COLUMNAS; col++) {
            displayBuffer[fil][col] = ' ';
        }
    }
    
    Fila_Personaje = 1;
    Ult_Fila_Personaje = 1;
    Activo = 1;
    Cont_Obstaculo = 0;
    puntuacion = 0;
    
    displayBuffer[Fila_Personaje][Columna_Personaje] = PERSONAJE;
    
    actualizar_pantalla();
    actualizar_score();
    
    // Inicializar telemetría
    inicializar_telemetria();
    
    gameInitialized = 1;
    
    UART_Escr_String("Juego inicializado\r\n");
}

void reiniciar_juego(void) {
    unsigned char fil, col;
    
    for(fil = 0; fil < FILAS; fil++) {
        for(col = 0; col < COLUMNAS; col++) {
            displayBuffer[fil][col] = ' ';
        }
    }
    
    Fila_Personaje = 1;
    Ult_Fila_Personaje = 1;
    Activo = 1;
    Cont_Obstaculo = 0;
    puntuacion = 0;
    
    displayBuffer[Fila_Personaje][Columna_Personaje] = PERSONAJE;
    
    actualizar_pantalla();
    actualizar_score();
    
    // Reiniciar telemetría
    inicializar_telemetria();
}

void leer_botones(void) {
    if(SALTA == 1 && Fila_Personaje != 0) {
        displayBuffer[Ult_Fila_Personaje][Columna_Personaje] = ' ';
        Ult_Fila_Personaje = Fila_Personaje;
        Fila_Personaje = 0;
        displayBuffer[Fila_Personaje][Columna_Personaje] = PERSONAJE;
        __delay_ms(20);
    }
    else if(AGACHA == 1 && Fila_Personaje != 1) {
        displayBuffer[Ult_Fila_Personaje][Columna_Personaje] = ' ';
        Ult_Fila_Personaje = Fila_Personaje;
        Fila_Personaje = 1;
        displayBuffer[Fila_Personaje][Columna_Personaje] = PERSONAJE;
        __delay_ms(20);
    }
}

void generar_obstaculo(void) {
    if(displayBuffer[0][COLUMNAS - 4] == ' ' && displayBuffer[1][COLUMNAS - 4] == ' ') {
        unsigned char fila_obstaculo = random_number(2);
        displayBuffer[fila_obstaculo][COLUMNAS - 4] = OBSTACULO;
    }
}

void desplazar_mundo(void) {
    unsigned char fil, col;
    
    for(fil = 0; fil < FILAS; fil++) {
        for(col = 0; col < COLUMNAS - 4; col++) {
            displayBuffer[fil][col] = displayBuffer[fil][col + 1];
        }
        displayBuffer[fil][COLUMNAS - 4] = ' ';
    }
}

void actualizar_pantalla(void) {
    unsigned char fil, col;
    
    for(fil = 0; fil < FILAS; fil++) {
        LCD_Posicion(0, fil);
        for(col = 0; col < COLUMNAS - 3; col++) {
            DIGITO(displayBuffer[fil][col]);
        }
    }
}

