jorsasoldo/IS_Proyecto_Videojuego_Runner/IS_PROYECTO_VIDEOJUEGO/Microcontrolador/PIC16F877A/Videojuego.c
void actualizar_score(void) {
    unsigned char decenas = '0' + (puntuacion / 10);
    unsigned char unidades = '0' + (puntuacion % 10);
    
    LCD_Posicion(SCORE_COL, 0);
    DIGITO(decenas);
    DIGITO(unidades);
}

unsigned char random_number(unsigned char max) {
    semilla += TMR0;
    semilla = (semilla * 13 + 17) % 251;
    return semilla % max;
}

// ============ DETECCIÓN DE COLISIONES ============
unsigned char detectar_colision(void) {
    // Verifica si el personaje está en la misma posición que un obstáculo
    if(displayBuffer[Fila_Personaje][Columna_Personaje] == OBSTACULO) {
        return 1;  // Colisión detectada
    }
    return 0;  // Sin colisión
}

// ============ EVALUACIÓN DE METAS ============
void evaluar_metas(void) {
    // Meta tipo 1: Obstáculos esquivados
    if(nivel.goalType == 1) {
        if(telemetria.obstaclesEsquivados >= nivel.goalValue) {
            // Victoria por obstáculos
            Activo = 0;
            telemetria.resultado = 1;  // Win
            
            COMANDO(0x01);
            __delay_ms(2);
            
            LCD_Posicion(0, 0);
            LCD_Escr_String("GANASTE!");
            LCD_Posicion(0, 1);
            LCD_Escr_String("Obstac: ");
            
            unsigned char dec = '0' + (telemetria.obstaclesEsquivados / 10);
            unsigned char uni = '0' + (telemetria.obstaclesEsquivados % 10);
            DIGITO(dec);
            DIGITO(uni);
            
            __delay_ms(3000);
            
            // Enviar telemetría
            enviar_telemetria();
            
            gameInitialized = 0;
            
            LCD_Posicion(0, 0);
            LCD_Escr_String("Esperando");
            LCD_Posicion(0, 1);
            LCD_Escr_String("config...");
        }
    }
    // Meta tipo 0: Tiempo sobrevivido
    else if(nivel.goalType == 0) {
        if(telemetria.tiempoTranscurrido >= nivel.goalValue) {
            // Victoria por tiempo
            Activo = 0;
            telemetria.resultado = 1;  // Win
            
            COMANDO(0x01);
            __delay_ms(2);
            
            LCD_Posicion(0, 0);
            LCD_Escr_String("GANASTE!");
            LCD_Posicion(0, 1);
            LCD_Escr_String("Tiempo: ");
            
            unsigned char dec = '0' + (telemetria.tiempoTranscurrido / 10);
            unsigned char uni = '0' + (telemetria.tiempoTranscurrido % 10);
            DIGITO(dec);
            DIGITO(uni);
            DIGITO('s');
            
            __delay_ms(3000);
            
            // Enviar telemetría
            enviar_telemetria();
            
            gameInitialized = 0;
            
            LCD_Posicion(0, 0);
            LCD_Escr_String("Esperando");
            LCD_Posicion(0, 1);
            LCD_Escr_String("config...");
        }
    }
}

// ============ FUNCIÓN PRINCIPAL ============
void main(void) {
    unsigned char i;
    
    // Configuración de puertos
    TRISB = 0x00;
    TRISC = 0x00;
    TRISD = 0b00000011;
    
    PORTB = 0x00;
    PORTC = 0x00;
    PORTD = 0x00;
    
    // Configurar Timer0 para aleatorios
    OPTION_REGbits.T0CS = 1;
    OPTION_REGbits.PSA = 0;
    OPTION_REGbits.PS = 0b111;
    
    ADCON1 = 0x07;
    CMCON = 0x07;
    
    // Inicializar subsistemas
    UART_Init();
    LCD_Init();
    Timer1_Init();
    inicializarNivel();
    limpiarRecursos();
    
    TMR0 = 0;
    semilla = TMR0;
    
    UART_Escr_String("Sistema listo\r\n");
    
    LCD_Posicion(0, 0);
    LCD_Escr_String("Esperando");
    LCD_Posicion(0, 1);
    LCD_Escr_String("config...");
    
    // ===== LOOP PRINCIPAL =====
    while(1) {
        // ===== FASE 1: ESPERAR CONFIGURACIÓN =====
        if(buscaChar('}') && !gameInitialized) {
            __delay_ms(100);
            
            JSON_Parse();
            
            if(validarConfiguracion()) {
                LCD_CargarTodosSprites();
                __delay_ms(100);
                enviarConfirmacion();
                inicializar_juego();
                limpiarRecursos();
            } else {
                UART_Escr_String("{\"status\":\"error\",\"message\":\"invalid config\"}\r\n");
            }
            
            __delay_ms(100);
        }
        
        // ===== FASE 2: LOOP DEL JUEGO =====
        if(gameInitialized && Activo) {
            // Leer botones
            leer_botones();
            
            // Actualizar pantalla
            actualizar_pantalla();
            
            // Generar obstáculos
            if(++Cont_Obstaculo >= 4) {
                Cont_Obstaculo = 0;
                generar_obstaculo();
            }
            
            // Desplazar mundo
            desplazar_mundo();
            
            // Actualizar pantalla
            actualizar_pantalla();
            
            // Actualizar score si cambia
            static unsigned char Ult_Puntuacion = 0;
            if(puntuacion != Ult_Puntuacion) {
                actualizar_score();
                Ult_Puntuacion = puntuacion;
            }
            
            // ===== DETECCIÓN DE COLISIONES =====
            if(detectar_colision()) {
                Activo = 0;
                telemetria.resultado = 0;  // Lose
                
                COMANDO(0x01);
                __delay_ms(2);
                
                LCD_Posicion(0, 0);
                LCD_Escr_String("GAME OVER!");
                LCD_Posicion(0, 1);
                LCD_Escr_String("Obst: ");
                
                unsigned char dec = '0' + (telemetria.obstaclesEsquivados / 10);
                unsigned char uni = '0' + (telemetria.obstaclesEsquivados % 10);
                DIGITO(dec);
                DIGITO(uni);
                
                __delay_ms(3000);
                
                // Enviar telemetría de pérdida
                enviar_telemetria();
                
                gameInitialized = 0;
                
                LCD_Posicion(0, 0);
                LCD_Escr_String("Esperando");
                LCD_Posicion(0, 1);
                LCD_Escr_String("config...");
            }
            
            // ===== INCREMENTAR OBSTÁCULOS ESQUIVADOS =====
            // Cuando un obstáculo pasa por la columna 0 (donde está el personaje)
            // y no hubo colisión, se cuenta como esquivado
            if(displayBuffer[1][0] == OBSTACULO || displayBuffer[0][0] == OBSTACULO) {
                puntuacion++;
                telemetria.obstaclesEsquivados++;
            }
            
            // ===== EVALUACIÓN DE METAS =====
            evaluar_metas();
            
            // Velocidad del juego
            __delay_ms(150);
        }
        
        // Pausa pequeña
        __delay_ms(10);
        
        // Mantenimiento preventivo
        static unsigned char contador = 0;
        if(++contador > 100) {
            contador = 0;
            if(UART_Disp() && !buscaChar('{') && !gameInitialized) {
                limpiarRecursos();
            }
        }
    }
}
